index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-14 Sun 20:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Matt's Home Page</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matthew K. Junker" />









</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Matt's Home Page</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org101318a">Junker's Laws</a></li>
<li><a href="#org948c5d5">Documents and Media</a>
<ul>
<li><a href="#org7b981e3">Emacs Files</a></li>
<li><a href="#org7cf6143">Navy Documents</a></li>
<li><a href="#org41e46e2">Sounds</a></li>
<li><a href="#org66f8472">Pictures</a></li>
<li><a href="#org4062b99">Postscript Files</a></li>
</ul>
</li>
<li><a href="#orgc77be5d">Sheepshead</a></li>
<li><a href="#org58b784a">Page 2</a>
<ul>
<li><a href="#orgb582d94">Text</a></li>
<li><a href="#orgf6751ef">Math</a></li>
</ul>
</li>
<li><a href="#org40dcee7">Links</a></li>
</ul>
</div>
</div>
<p>
Click on a heading to see more.  Press <code>i</code> to change views.
</p>

<p>
My permanent link is <a href="https://alum.mit.edu/www/junker">https://alum.mit.edu/www/junker</a>.
</p>

<p>
This page is under construction.  My original page is at
<a href="https://sites.google.com/site/mkjunker">https://sites.google.com/site/mkjunker</a>.  Please look there for missing
content, which will be moved here soon (I hope).  <span class="timestamp-wrapper"><span class="timestamp">[2021-02-10 Wed]</span></span>
</p>

<a class="weatherwidget-io" href="https://forecast7.com/en/43d24n87d98/thiensville/?unit=us" data-label_1="THIENSVILLE" data-label_2="WEATHER" data-theme="original" >THIENSVILLE WEATHER</a>
<script>
!function(d,s,id){var js,fjs=d.getElementsByTagName(s)[0];if(!d.getElementById(id)){js=d.createElement(s);js.id=id;js.src='https://weatherwidget.io/js/widget.min.js';fjs.parentNode.insertBefore(js,fjs);}}(document,'script','weatherwidget-io-js');
</script>

<iframe src="https://www.ndbc.noaa.gov/widgets/station_page.php?station=PWAW3" style="border: solid thin #3366ff; width:200px; height:300px"></iframe>
<iframe src="https://www.ndbc.noaa.gov/widgets/station_page.php?station=MLWW3" style="border: solid thin #3366ff; width:200px; height:300px"></iframe>
<iframe src="https://www.ndbc.noaa.gov/widgets/station_page.php?station=45013" style="border: solid thin #3366ff; width:200px; height:300px"></iframe>
<iframe src="https://www.ndbc.noaa.gov/widgets/station_page.php?station=45007" style="border: solid thin #3366ff; width:200px; height:300px"></iframe>

<div id="outline-container-org101318a" class="outline-2">
<h2 id="org101318a">Junker's Laws</h2>
<div class="outline-text-2" id="text-org101318a">
<ol class="org-ol">
<li>If you're using Excel, you're probably doing it wrong.</li>
<li>The best review is trying to implement the code or test.</li>
</ol>
</div>
</div>

<div id="outline-container-org948c5d5" class="outline-2">
<h2 id="org948c5d5">Documents and Media</h2>
<div class="outline-text-2" id="text-org948c5d5">
</div>
<div id="outline-container-org7b981e3" class="outline-3">
<h3 id="org7b981e3">Emacs Files</h3>
<div class="outline-text-3" id="text-org7b981e3">
<ul class="org-ul">
<li><a href="https://github.com/mkjunker">https://github.com/mkjunker</a> contains all of my public Emacs lisp
files.</li>
</ul>
</div>
</div>
<div id="outline-container-org7cf6143" class="outline-3">
<h3 id="org7cf6143">Navy Documents</h3>
<div class="outline-text-3" id="text-org7cf6143">
<ul class="org-ul">
<li><a href="https://drive.google.com/file/d/1RMurM18N3aC_bCx8Nn70R4xZGgbomD_G/view?usp=drive_web">USS <i>Woodrow Wilson</i> inactivation program, 24 September 1993</a></li>
<li><a href="https://drive.google.com/file/d/1LqZOCDkWdKj85EVnD5DiRJNeUK7o25W6/view?usp=drive_web">Flooding in the Fan Room, <i>Fathom</i> Magazine, September/October 1993</a></li>
<li><a href="https://drive.google.com/file/d/0B65OWczbRgzAWWxiTU1RTFAwRXc/view?usp=drive_web">A Review of the United States Naval Nuclear Propulsion Program, June 1987</a></li>
<li><a href="https://drive.google.com/file/d/0B65OWczbRgzAR0kzeF9FYXRIRmc/view?usp=drive_web">Polaris-Poseidon Fleet Ballistic Missle Fact Sheet 1967</a></li>
</ul>
</div>
</div>
<div id="outline-container-org41e46e2" class="outline-3">
<h3 id="org41e46e2">Sounds</h3>
<div class="outline-text-3" id="text-org41e46e2">
<ul class="org-ul">
<li>USS <i>Woodrow Wilson</i> diving alarm, <a href="https://freesound.org/people/mkjunker/sounds/156672/">WAV version</a>, <a href="https://drive.google.com/file/d/0B65OWczbRgzAaWxNOEVpQWx0am8/view?usp=drive_web">MP3 version</a></li>
<li><a href="https://drive.google.com/file/d/0B65OWczbRgzAOTNZTEJDdTFCVEE/view?usp=drive_web">"Just As I Am"</a></li>
</ul>
</div>
</div>
<div id="outline-container-org66f8472" class="outline-3">
<h3 id="org66f8472">Pictures</h3>
<div class="outline-text-3" id="text-org66f8472">
<ul class="org-ul">
<li><a href="https://drive.google.com/file/d/0B65OWczbRgzAb0tqdDJ5SnFVak0/view?usp=drive_web">USS <i>Woodrow Wilson</i> wardroom, outboard of USS <i>Orion</i>, Santo Stefano Island, Italy, 1992</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4062b99" class="outline-3">
<h3 id="org4062b99">Postscript Files</h3>
<div class="outline-text-3" id="text-org4062b99">
<p>
/The following plotting tools are provided as-is. The author makes
no guarantees about their accuracy or usefulness. Use them at your
own risk./
</p>

<p>
Don't have a Postscript printer? Try (<a href="http://pages.cs.wisc.edu/~ghost/">Ghostscript and Ghostview
(GSView for Windows environments)</a>. These tools allow viewing and
printing Postscript files.
</p>

<p>
Some of the Postscript files were developed using MetaPost. A Windows
version of MetaPost is included with MikTeX at The MikTeX Project
Page. For more on MetaPost, try:
</p>
<ul class="org-ul">
<li><a href="http://www.tug.org/metapost.html">TUG's MetaPost page</a></li>
</ul>

<p>
Files:
</p>
<ul class="org-ul">
<li>maneuvering board: <a href="https://drive.google.com/file/d/0B65OWczbRgzAREJJaHV0d1FRZmM/view?usp=drive_web">postscript</a>, <a href="https://drive.google.com/file/d/0B65OWczbRgzATkx4YWF3ZEdEcGM/view?usp=drive_web">MetaPost source</a> <a href="https://msi.nga.mil/media/ManeuveringBoard.pdf">PDF from NGA</a> <a href="https://msi.nga.mil/Publications/RNMB">https://msi.nga.mil/Publications/RNMB</a></li>
<li>navigation plot: <a href="https://drive.google.com/file/d/0B65OWczbRgzANUNrYnBvUHVGWU0/view?usp=drive_web">postscript</a>, <a href="https://drive.google.com/file/d/0B65OWczbRgzAbnJMRHN2SmJsNGs/view?usp=drive_web">MetaPost source</a></li>
<li>wind chill chart: <a href="https://drive.google.com/file/d/0B65OWczbRgzAd2YtSDBoVUdrcGs/view?usp=drive_web">postscript</a>, <a href="https://drive.google.com/file/d/0B65OWczbRgzAbkRRdFNzcmVnVzQ/view?usp=drive_web">gnuplot source</a></li>
</ul>
<p>
<i>TO DO: move these files.</i>
</p>
</div>
</div>
</div>
<div id="outline-container-orgc77be5d" class="outline-2">
<h2 id="orgc77be5d">Sheepshead</h2>
<div class="outline-text-2" id="text-orgc77be5d">
<p>
Trump Precedence: <br />
Q&clubs; Q&spades; Q&hearts; Q&diamond;   J&clubs; J&spades; J&hearts;
J&diamond; A&diamond; 10&diamond; K&diamond; 9&diamond; 8&diamond;
7&diamond;
</p>

<p>
Fail Precedence: <br />
(&clubs; &spades; &diamond;) A 10 K 9 8 7
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Card</b></td>
<td class="org-right">A</td>
<td class="org-right">10</td>
<td class="org-right">K</td>
<td class="org-right">Q</td>
<td class="org-right">J</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right"><b>Points</b></td>
<td class="org-right">11</td>
<td class="org-right">10</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Points</td>
<td class="org-center">0</td>
<td class="org-center">1-30</td>
<td class="org-center">31-60</td>
<td class="org-center">61-90</td>
<td class="org-center">91-119</td>
<td class="org-center">120</td>
</tr>

<tr>
<td class="org-right">Partner Score</td>
<td class="org-center">+3</td>
<td class="org-center">+2</td>
<td class="org-center">+1</td>
<td class="org-center">-1</td>
<td class="org-center">-2</td>
<td class="org-center">-3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org58b784a" class="outline-2">
<h2 id="org58b784a">Page 2</h2>
<div class="outline-text-2" id="text-org58b784a">
</div>
<div id="outline-container-orgb582d94" class="outline-3">
<h3 id="orgb582d94">Text</h3>
<div class="outline-text-3" id="text-orgb582d94">
<p>
Aliquam erat volutpat.  Nunc eleifend leo vitae magna.  In id erat non
orci commodo lobortis.  Proin neque massa, cursus ut, gravida ut,
lobortis eget, lacus.  Sed diam.  Praesent fermentum tempor tellus.
Nullam tempus.  Mauris ac felis vel velit tristique imperdiet.  Donec
at pede.  Etiam vel neque nec dui dignissim bibendum.  Vivamus id
enim.  Phasellus neque orci, porta a, aliquet quis, semper a, massa.
Phasellus purus.  Pellentesque tristique imperdiet tortor.  Nam
euismod tellus id erat.
</p>
</div>
</div>

<div id="outline-container-orgf6751ef" class="outline-3">
<h3 id="orgf6751ef">Math</h3>
<div class="outline-text-3" id="text-orgf6751ef">
<p>
\(\sin(x) / x\)
</p>
</div>
</div>
</div>

<div id="outline-container-org40dcee7" class="outline-2">
<h2 id="org40dcee7">Links</h2>
<div class="outline-text-2" id="text-org40dcee7">
<ul class="org-ul">
<li>Permanent link to my home page: <a href="https://alum.mit.edu/www/junker">https://alum.mit.edu/www/junker</a></li>
<li>My other page (soon to be redundant):
<a href="https://sites.google.com/site/mkjunker">https://sites.google.com/site/mkjunker</a></li>
<li><a href="./sitemap.html">Site map</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew K. Junker</p>
<p class="date">Created: 2021-03-14 Sun 20:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
